{"config": [{"config": {"kernel_constraint": null, "kernel_size": [3, 3], "padding": "same", "batch_input_shape": [null, 224, 224, 3], "activation": "linear", "bias_regularizer": null, "dtype": "float32", "strides": [1, 1], "trainable": true, "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_1", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 64, "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "batch_normalization_1", "gamma_constraint": null, "center": true, "trainable": true, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "dropout_1", "seed": null, "rate": 0.3, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "kernel_size": [3, 3], "padding": "same", "activation": "linear", "bias_regularizer": null, "trainable": true, "strides": [1, 1], "name": "conv2d_2", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 64, "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "batch_normalization_2", "gamma_constraint": null, "center": true, "trainable": true, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "kernel_size": [3, 3], "padding": "same", "activation": "linear", "bias_regularizer": null, "trainable": true, "strides": [1, 1], "name": "conv2d_3", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 128, "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "batch_normalization_3", "gamma_constraint": null, "center": true, "trainable": true, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "dropout_2", "seed": null, "rate": 0.4, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "kernel_size": [3, 3], "padding": "same", "activation": "linear", "bias_regularizer": null, "trainable": true, "strides": [1, 1], "name": "conv2d_4", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 128, "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "batch_normalization_4", "gamma_constraint": null, "center": true, "trainable": true, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_2", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "kernel_size": [3, 3], "padding": "same", "activation": "linear", "bias_regularizer": null, "trainable": true, "strides": [1, 1], "name": "conv2d_5", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 256, "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "class_name": "Activation"}, {"config": {"scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "batch_normalization_5", "gamma_constraint": null, "center": true, "trainable": true, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "dropout_3", "seed": null, "rate": 0.4, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "kernel_size": [3, 3], "padding": "same", "activation": "linear", "bias_regularizer": null, "trainable": true, "strides": [1, 1], "name": "conv2d_6", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 256, "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "class_name": "Activation"}, {"config": {"scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "batch_normalization_6", "gamma_constraint": null, "center": true, "trainable": true, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "dropout_4", "seed": null, "rate": 0.4, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "kernel_size": [3, 3], "padding": "same", "activation": "linear", "bias_regularizer": null, "trainable": true, "strides": [1, 1], "name": "conv2d_7", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 256, "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_7"}, "class_name": "Activation"}, {"config": {"scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "batch_normalization_7", "gamma_constraint": null, "center": true, "trainable": true, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_3", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"pool_size": [28, 28], "strides": [28, 28], "trainable": true, "padding": "valid", "name": "max_pooling2d_4", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "activation": "linear", "units": 51, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "activity_regularizer": null, "name": "dense_1", "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "sigmoid", "name": "activation_8"}, "class_name": "Activation"}], "backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential"}